// Copyright 2024 The Fuchsia Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

// This file is automatically generated by //sdk/lib/driver/runtime/rust/fdf_sys:fdf_sys_bindgen_golden.

#![expect(non_camel_case_types)]

use libasync_sys::*;
use zx_types::*;

pub type fdf_handle_t = zx_handle_t;
pub type fdf_txid_t = zx_txid_t;
#[repr(C)]
#[derive(Debug)]
pub struct fdf_arena {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fdf_channel_call_args {
    pub wr_arena: *mut fdf_arena,
    pub wr_data: *mut ::core::ffi::c_void,
    pub wr_num_bytes: u32,
    pub wr_handles: *mut zx_handle_t,
    pub wr_num_handles: u32,
    pub rd_arena: *mut *mut fdf_arena,
    pub rd_data: *mut *mut ::core::ffi::c_void,
    pub rd_num_bytes: *mut u32,
    pub rd_handles: *mut *mut zx_handle_t,
    pub rd_num_handles: *mut u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fdf_channel_call_args"][::core::mem::size_of::<fdf_channel_call_args>() - 80usize];
    ["Alignment of fdf_channel_call_args"]
        [::core::mem::align_of::<fdf_channel_call_args>() - 8usize];
    ["Offset of field: fdf_channel_call_args::wr_arena"]
        [::core::mem::offset_of!(fdf_channel_call_args, wr_arena) - 0usize];
    ["Offset of field: fdf_channel_call_args::wr_data"]
        [::core::mem::offset_of!(fdf_channel_call_args, wr_data) - 8usize];
    ["Offset of field: fdf_channel_call_args::wr_num_bytes"]
        [::core::mem::offset_of!(fdf_channel_call_args, wr_num_bytes) - 16usize];
    ["Offset of field: fdf_channel_call_args::wr_handles"]
        [::core::mem::offset_of!(fdf_channel_call_args, wr_handles) - 24usize];
    ["Offset of field: fdf_channel_call_args::wr_num_handles"]
        [::core::mem::offset_of!(fdf_channel_call_args, wr_num_handles) - 32usize];
    ["Offset of field: fdf_channel_call_args::rd_arena"]
        [::core::mem::offset_of!(fdf_channel_call_args, rd_arena) - 40usize];
    ["Offset of field: fdf_channel_call_args::rd_data"]
        [::core::mem::offset_of!(fdf_channel_call_args, rd_data) - 48usize];
    ["Offset of field: fdf_channel_call_args::rd_num_bytes"]
        [::core::mem::offset_of!(fdf_channel_call_args, rd_num_bytes) - 56usize];
    ["Offset of field: fdf_channel_call_args::rd_handles"]
        [::core::mem::offset_of!(fdf_channel_call_args, rd_handles) - 64usize];
    ["Offset of field: fdf_channel_call_args::rd_num_handles"]
        [::core::mem::offset_of!(fdf_channel_call_args, rd_num_handles) - 72usize];
};
impl Default for fdf_channel_call_args {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fdf_channel_call_args_t = fdf_channel_call_args;
#[doc = " This flag will prevent any dispatchers from being created on the role that allow sync calls."]
pub const FDF_SCHEDULER_ROLE_OPTION_NO_SYNC_CALLS: u32 = 1;
#[doc = " This flag disallows parallel calls into callbacks set in the dispatcher."]
pub const FDF_DISPATCHER_OPTION_SYNCHRONIZED: u32 = 0;
#[doc = " This flag allows parallel calls into callbacks set in the dispatcher.\n Cannot be set in conjunction with `FDF_DISPATCHER_OPTION_ALLOW_SYNC_CALLS`."]
pub const FDF_DISPATCHER_OPTION_UNSYNCHRONIZED: u32 = 1;
#[doc = " This flag indicates that the dispatcher may not share zircon threads with other drivers.\n Cannot be set in conjunction with `FDF_DISPATCHER_OPTION_UNSYNCHRONIZED`."]
pub const FDF_DISPATCHER_OPTION_ALLOW_SYNC_CALLS: u32 = 2;
#[doc = " This flag indicates that the dispatcher must not have its thread migrated at\n runtime. It can only be used if the dispatcher's scheduler role has the\n `FDF_SCHEDULER_ROLE_OPTION_NO_SYNC_CALLS` option set."]
pub const FDF_DISPATCHER_OPTION_NO_THREAD_MIGRATION: u32 = 4;
pub const FDF_DISPATCHER_OPTION_SYNCHRONIZATION_MASK: u32 = 1;
#[doc = " This flag forces a channel wait to call its callback on cancellation,\n even if the wait starts on a synchronized dispatcher. This allows\n for safe cancellation of the wait from a different dispatcher than the one\n it started on."]
pub const FDF_CHANNEL_WAIT_OPTION_FORCE_ASYNC_CANCEL: u32 = 1;
#[doc = " This flag indicates that the channel wait was scheduled on an always-on\n dispatcher."]
pub const FDF_CHANNEL_WAIT_OPTION_ALWAYS_ON: u32 = 2;
#[doc = " An arena which supports allocation of memory.\n\n The arena owns all the allocated memory. Individual memory allocations can be freed\n by calling |fdf_arena_free|, or will be freed when all references to the underlying\n runtime arena object are destroyed.\n\n |fdf_arena_create| will return a reference to a newly created runtime arena object.\n Passing an arena to |fdf_channel_write| will create and transfer a new reference to\n that same arena, and does not take ownership of your arena reference. The reference\n may be destroyed using |fdf_arena_drop_ref|.\n\n # Thread safety\n\n Operations on arena objects are thread-safe.\n\n # Example\n\n   fdf_arena_t* arena;\n   zx_status_t status = fdf_arena_create(0, 'exam', 0, &arena);\n\n   // Allocate new blocks of memory.\n   void* addr1 = fdf_arena_allocate(arena, 0x1000);\n   void* addr2 = fdf_arena_allocate(arena, 0x2000);\n\n   // Use the allocated memory...\n\n   fdf_arena_drop_ref(arena);"]
pub type fdf_arena_t = fdf_arena;
pub type fdf_arena_tag_t = u32;
unsafe extern "C" {
    #[doc = " Creates a FDF arena for allocating memory.\n\n |tag| provides a hint to the runtime so that it may be more efficient.\n For example, adjusting the size of the buffer backing the arena to the expected\n total size of allocations. It may also be surfaced in debug information.\n\n # Errors\n\n ZX_ERR_INVALID_ARGS: |options| is any value other than 0.\n\n ZX_ERR_NO_MEMORY: Failed due to a lack of memory."]
    pub fn fdf_arena_create(
        options: u32,
        tag: fdf_arena_tag_t,
        out_arena: *mut *mut fdf_arena_t,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Returns a pointer to allocated memory of size |bytes|. The memory is managed by the arena\n until it is freed by |fdf_arena_free|, or the arena is destroyed once every reference to\n the arena hss been destroyed using |fdf_arena_drop_ref|."]
    pub fn fdf_arena_allocate(arena: *mut fdf_arena_t, bytes: usize) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Hints to the arena that the |ptr| previously allocated by |fdf_arena_allocate| may be reclaimed.\n Memory is not guaranteed to be reclaimed until |fdf_arena_drop_ref| is invoked.\n Asserts if the memory is not managed by the arena."]
    pub fn fdf_arena_free(arena: *mut fdf_arena_t, ptr: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    #[doc = " Returns whether the memory region consisting of [|ptr|, |ptr|+|num_bytes|) resides entirely\n within memory managed by the |arena|."]
    pub fn fdf_arena_contains(
        arena: *mut fdf_arena_t,
        ptr: *const ::core::ffi::c_void,
        num_bytes: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Increments the reference count to the underlying runtime arena object.\n This is intended mostly for use with FFIs, such as for Rust, to enable\n more ergonomic use. Users in C should not need to call this, as\n the reference count will be properly managed with the `fdf_channel_*`\n and `fdf_arena_drop_ref` functions.\n Calls to this function must be balanced by corresponding calls to\n `fdf_arena_drop_ref`."]
    pub fn fdf_arena_add_ref(arena: *mut fdf_arena_t);
}
unsafe extern "C" {
    #[doc = " Destroys the reference to the underlying runtime arena object.\n If there are no more references to the arena, all memory associated with\n the arena will be freed."]
    pub fn fdf_arena_drop_ref(arena: *mut fdf_arena_t);
}
#[repr(C)]
#[derive(Debug)]
pub struct fdf_dispatcher {
    _unused: [u8; 0],
}
#[doc = " Dispatcher for performing asynchronous operations.\n\n |fdf_dispatcher_t| can be used in conjunction with a |fdf_channel_t|\n to initiate asynchronous read operations. The dispatcher is in\n charge of dispatching the read callbacks.\n\n # Thread safety\n\n Operations on dispatcher objects are thread-safe.\n\n # Example\n\n   void shutdown_handler(fdf_dispatcher_t* dispatcher,\n                         fdf_dispatcher_shutdown_observer_t* fdf_observer) {\n     // Handle dispatcher shutdown.\n     // It is now safe to destroy |dispatcher|.\n   }\n\n   struct dispatcher_shutdown_observer {\n     fdf_dispatcher_shutdown_observer_t fdf_observer;\n     my_ctx* ctx;\n   };\n\n   void driver_start(void) {\n     const char* name = \"my_driver\";\n     const char* scheduler_role = \"\";\n     struct dispatcher_shutdown_observer my_observer;\n     my_observer.fdf_observer.handler = shutdown_handler;\n     ...\n\n     fdf_dispatcher_t* dispatcher;\n     zx_status_t status = fdf_dispatcher_create(0, name, strlen(name),\n                                                scheduler_role, strlen(scheduler_role),\n                                                &my_observer.fdf_observer, &dispatcher);\n\n     fdf_channel_read_t channel_read;\n     ...\n     status = fdf_channel_wait_async(dispatcher, channel_read, 0);\n\n     // The dispatcher will call the channel_read handler when ready.\n\n     // This begins the dispatcher shutdown process.\n     fdf_dispatcher_shutdown_async(dispatcher);\n   }"]
pub type fdf_dispatcher_t = fdf_dispatcher;
#[doc = " Holds context for the observer which will be called when the dispatcher's\n asynchronous shutdown has completed.\n\n After creating the dispatcher, the client is responsible for retaining\n this structure in memory (and unmodified) until the handler runs."]
pub type fdf_dispatcher_shutdown_observer_t = fdf_dispatcher_shutdown_observer;
#[doc = " Called when the asynchronous shutdown for |dispatcher| has completed."]
pub type fdf_dispatcher_shutdown_handler_t = ::core::option::Option<
    unsafe extern "C" fn(
        dispatcher: *mut fdf_dispatcher_t,
        observer: *mut fdf_dispatcher_shutdown_observer_t,
    ),
>;
#[doc = " Holds context for the observer which will be called when the dispatcher's\n asynchronous shutdown has completed.\n\n After creating the dispatcher, the client is responsible for retaining\n this structure in memory (and unmodified) until the handler runs."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fdf_dispatcher_shutdown_observer {
    pub handler: fdf_dispatcher_shutdown_handler_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fdf_dispatcher_shutdown_observer"]
        [::core::mem::size_of::<fdf_dispatcher_shutdown_observer>() - 8usize];
    ["Alignment of fdf_dispatcher_shutdown_observer"]
        [::core::mem::align_of::<fdf_dispatcher_shutdown_observer>() - 8usize];
    ["Offset of field: fdf_dispatcher_shutdown_observer::handler"]
        [::core::mem::offset_of!(fdf_dispatcher_shutdown_observer, handler) - 0usize];
};
unsafe extern "C" {
    #[doc = " Creates a dispatcher for performing asynchronous operations.\n\n |options| provides the dispatcher configuration. The following options are supported:\n   * `FDF_DISPATHER_OPTION_SYNCHRONIZED` or `FDF_DISPATCHER_OPTION_UNSYNCHRONIZED` - sets whether\n     parallel callbacks in the callbacks set in the dispatcher are allowed.\n   * `FDF_DISPATCHER_OPTION_ALLOW_SYNC_CALLS` - the dispatcher may not share zircon threads with\n     other drivers. This may not be set with `FDF_DISPATCHER_OPTION_UNSYNCHRONIZED` or on a\n     scheduler role that has `FDF_SCHEDULER_ROLE_OPTION_NO_SYNC_CALLS` set on it.\n\n |name| is reported via diagnostics. It is similar to setting the name of a thread.\n |name_len| is the length of the string, without including the terminated NULL character. If\n |name| is greater than `ZX_MAX_NAME_LEN`, the length may be truncated.\n\n |scheduler_role| is a hint. It may or not impact the priority the work scheduler against the\n dispatcher is handled at. It may or may not impact the ability for other drivers to share zircon\n threads with the dispatcher.\n |scheduler_role_len | is the length of the string, without including the terminating\n NULL character.\n\n |observer| will be called after |fdf_dispatcher_shutdown_async| has been called,\n and the dispatcher has completed its asynchronous shutdown.\n\n # Thread requirements\n\n This must be called from a thread managed by the driver runtime.\n\n # Errors\n\n ZX_ERR_NOT_SUPPORTED: |options| is not a supported configuration, which is any of the following:\n   * `FDF_DISPATCHER_OPTION_UNSYNCHRONIZED` with `FDF_DISPATCHER_OPTION_ALLOW_SYNC_CALLS`.\n\n ZX_ERR_INVALID_ARGS: This was not called from a thread managed by the driver runtime.\n\n ZX_ERR_NO_RESOURCES: A thread needed to be spawned to create this dispatcher, but couldn't be.\n This is likely because a dispatcher that allows sync calls was requested, but the thread pool is\n currently at its limit.\n\n ZX_ERR_BAD_STATE: Dispatchers are currently not allowed to be created, such as when a driver\n is being shutdown by its driver host."]
    pub fn fdf_dispatcher_create(
        options: u32,
        name: *const ::core::ffi::c_char,
        name_len: usize,
        scheduler_role: *const ::core::ffi::c_char,
        scheduler_role_len: usize,
        observer: *mut fdf_dispatcher_shutdown_observer_t,
        out_dispatcher: *mut *mut fdf_dispatcher_t,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Returns the asynchronous dispatch interface."]
    pub fn fdf_dispatcher_get_async_dispatcher(
        dispatcher: *mut fdf_dispatcher_t,
    ) -> *mut async_dispatcher_t;
}
unsafe extern "C" {
    #[doc = " Returns an unowned dispatcher provided an async dispatcher. If |async_dispatcher| was not\n retrieved via |fdf_dispatcher_get_async_dispatcher|, the call will result in a crash."]
    pub fn fdf_dispatcher_downcast_async_dispatcher(
        async_dispatcher: *mut async_dispatcher_t,
    ) -> *mut fdf_dispatcher_t;
}
unsafe extern "C" {
    #[doc = " Returns the current thread's dispatcher.\n This will return NULL if not called from a dispatcher managed thread."]
    pub fn fdf_dispatcher_get_current_dispatcher() -> *mut fdf_dispatcher_t;
}
unsafe extern "C" {
    #[doc = " Returns the options set for this dispatcher."]
    pub fn fdf_dispatcher_get_options(dispatcher: *const fdf_dispatcher_t) -> u32;
}
unsafe extern "C" {
    #[doc = " Begins shutting down the dispatcher. Shutting down is an asynchronous operation.\n\n Once |fdf_dispatcher_shutdown_async| is called, the dispatcher will no longer\n accept queueing new |async_dispatcher_t| operations or |ChannelRead| callbacks.\n\n The dispatcher will asynchronously wait for all pending |async_dispatcher_t|\n and |ChannelRead| callbacks to complete. Then it will serially cancel all\n remaining callbacks with |ZX_ERR_CANCELED| and call the shutdown handler set\n in |fdf_dispatcher_create|.\n\n If the dispatcher is already shutting down or has completed shutdown, this will do nothing."]
    pub fn fdf_dispatcher_shutdown_async(dispatcher: *mut fdf_dispatcher_t);
}
unsafe extern "C" {
    #[doc = " Informs the runtime that |dispatcher| may be destroyed.\n\n The dispatcher must be completely shutdown before this is called,\n i.e. the shutdown handler set in |fdf_dispatcher_create| has been called.\n It is safe to call this from that shutdown handler.\n\n |dispatcher| must not be used after calling this function."]
    pub fn fdf_dispatcher_destroy(dispatcher: *mut fdf_dispatcher_t);
}
unsafe extern "C" {
    #[doc = " Removes an option set on the dispatcher during creation. The provided |option| parameter\n is removed from the |dispatcher| given. For example if the dispatcher was created with options\n that contained `FDF_DISPATCHER_OPTION_ALLOW_SYNC_CALLS`, calling this with that option will\n remove the ability of the dispatcher to make any more synchronous calls.\n\n The following options are supported for sealing (aka removal):\n  - `FDF_DISPATCHER_OPTION_ALLOW_SYNC_CALLS`\n\n # Thread requirements\n\n This must be called from the |dispatcher|'s own context.\n\n # Errors\n\n ZX_ERR_INVALID_ARGS: The |option| being removed is not a supported option.\n\n ZX_ERR_BAD_STATE: Not called from the same context as the given dispatcher or the dispatcher\n is not in a running state.\n\n ZX_ERR_ALREADY_EXISTS: The option did not exist on the dispatcher. This can happen if this is\n called more than once with the same option, or if it was not created with the option."]
    pub fn fdf_dispatcher_seal(dispatcher: *mut fdf_dispatcher_t, option: u32) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Returns the always-on dispatcher interface for the given dispatcher.\n\n The primary user of this is the driver's fuchsia.driver.framework/Driver FIDL server\n which executes the driver lifecycle methods (e.g. Start, Stop).\n\n The secondary user of this is for bindings and tasks that require execution during\n suspend/resume lifecycle hooks. The driver host only calls these hooks when its safe\n to do so (dependent elements still exist).\n\n WARNING: Any other use will lead to execution while suspended, which may be unexpected."]
    pub fn fdf_dispatcher_get_always_on_dispatcher(
        dispatcher: *mut fdf_dispatcher_t,
    ) -> *mut fdf_dispatcher_t;
}
unsafe extern "C" {
    #[doc = " Registers a wake vector. Callbacks for |signals| received on this handle while suspended,\n wake the driver and execute after the driver's Resume hook, but before anything else.\n\n The handle wait does not need to be registered before this is called.\n This is a sticky registration; all future waits registered with this handle will\n automatically inherit this wakeability.\n\n Registration is cumulative; new signals are combined with any existing wake signals\n registered for this handle.\n\n |handle| is borrowed\n |dispatcher| is the dispatcher that the wake vector applies to.\n |signals| are the signals that will wake the driver\n\n # Errors\n\n ZX_ERR_BAD_STATE: The dispatcher is suspended."]
    pub fn fdf_dispatcher_register_wake_vector(
        dispatcher: *mut fdf_dispatcher_t,
        handle: zx_handle_t,
        signals: zx_signals_t,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Unregisters the signals on the given handle as wake vectors.\n\n If the |signals| provided don't exactly match the signals that are currently\n registered, the delta between the two will still remain registered.\n\n |handle| is borrowed\n |dispatcher| is the dispatcher that the wake vector is removed from.\n |signals| are the signals that will be unregistered\n\n # Errors\n\n ZX_ERR_NOT_FOUND: The |handle| was never registered."]
    pub fn fdf_dispatcher_unregister_wake_vector(
        dispatcher: *mut fdf_dispatcher_t,
        handle: zx_handle_t,
        signals: zx_signals_t,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Closes a handle, causing the underlying object to be reclaimed by the runtime\n if no other handles to it exist.\n\n If there is a pending callback registered (such as via |fdf_channel_wait_async|),\n it must be cancelled before this is called. For unsynchronized dispatchers,\n cancellation is not considered complete until the callback is invoked.\n\n It is not an error to close the special \"never a valid handle\" |FDF_HANDLE_INVALID|,\n similar to free(NULL) being a valid call.\n\n Closing the last handle to a peered object using |fdf_handle_close| can affect the\n state of the object's peer (if any).\n\n This operation is thread-safe."]
    pub fn fdf_handle_close(handle: fdf_handle_t);
}
unsafe extern "C" {
    #[doc = " Creates a FDF channel, a bi-directional in-process message transport capable of\n sending arena-managed raw data bytes as well as handles from one side to the other.\n\n Two handles are returned on success, providing access to both sides of the channel.\n Messages written to one handle may be read from the opposite.\n\n # Errors\n\n ZX_ERR_INVALID_ARGS: |out0| or |out1| is an invalid pointer or NULL or |options| is any value\n other than 0.\n\n ZX_ERR_NO_MEMORY: Failed due to a lack of memory.\n\n ZX_ERR_NO_RESOURCES: No handles are available."]
    pub fn fdf_channel_create(
        options: u32,
        out0: *mut fdf_handle_t,
        out1: *mut fdf_handle_t,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Attempts to write a message to the channel specified by |channel|.\n\n The caller retains ownership of the |arena| reference, which must be destroyed via\n |fdf_arena_drop_ref|. It is okay to call |fdf_arena_drop_ref| on the arena as soon as\n the write call returns, as |fdf_arena_write| will take its own reference to the arena,\n extending the lifetime of the arena is until the data is read.\n\n The pointers |data| and |handles| may be NULL if their respective sizes are zero.\n |data| and |handles| must be pointers managed by |arena| if they are not NULL.\n |handles| may be a mix of zircon handles and fdf handles.\n\n Handles with a pending callback registered via |fdf_channel_wait_async| cannot be transferred.\n\n On success, all |num_handles| of the handles in the handles array are attached to the\n message and will become available to the reader of that message from the opposite end of the\n channel.\n\n All handles are consumed and are no longer available to the caller, on success or failure.\n\n # Errors\n\n ZX_ERR_INVALID_ARGS: |data| or |handles| are not pointers managed by |arena|,\n or any element in |handles| is not a valid handle,\n or at least one of |handles| has a pending callback registered via |fdf_channel_wait_async|.\n\n ZX_ERR_NO_MEMORY: Failed due to a lack of memory.\n\n ZX_ERR_PEER_CLOSED: The other side of the channel is closed.\n\n This operation is thread-safe."]
    pub fn fdf_channel_write(
        channel: fdf_handle_t,
        options: u32,
        arena: *mut fdf_arena_t,
        data: *mut ::core::ffi::c_void,
        num_bytes: u32,
        handles: *mut zx_handle_t,
        num_handles: u32,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Attempts to read the first message from the channel specified by |channel| into\n the |data| and |handles| buffers.\n\n Provides ownership of the |arena| reference, which must be destroyed via |fdf_arena_drop_ref|.\n\n The lifetime of |data| and |handles| are tied to the lifetime of |arena|.\n |handles| may be a mix of zircon handles and fdf handles.\n\n The length of bytes, in bytes, is stored in the location pointed to by |out_num_bytes|.\n The number of handles is stored in the location pointed to by |out_num_handles|.\n Either |out_num_bytes| or |out_num_handles| may be NULL, in which case they will be ignored.\n\n # Errors\n\n ZX_ERR_INVALID_ARGS: |arena| is NULL when |data| or |handles| are non-NULL.\n\n ZX_ERR_SHOULD_WAIT: The channel contained no messages to read.\n\n ZX_ERR_PEER_CLOSED: There are no available messages and the other\n side of the channel is closed.\n\n This operation is thread-safe."]
    pub fn fdf_channel_read(
        channel: fdf_handle_t,
        options: u32,
        out_arena: *mut *mut fdf_arena_t,
        out_data: *mut *mut ::core::ffi::c_void,
        out_num_bytes: *mut u32,
        out_handles: *mut *mut zx_handle_t,
        out_num_handles: *mut u32,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Begins asynchronously waiting for the channel set in |channel_read| to be readable.\n The |dispatcher| invokes the handler when the wait completes.\n Only one dispatcher can be registered at a time. The dispatcher will\n be considered unregistered immediately before the read handler is invoked.\n\n After successfully scheduling the read, the client is responsible for retaining\n the |channel_read| structure in memory (and unmodified) until the read handler runs,\n or the dispatcher shuts down.  Thereafter, the |channel_read| may be started again\n or destroyed.\n\n The read handler will be invoked exactly once. When the dispatcher is\n shutting down (being destroyed), the handlers of any remaining wait\n may be invoked with a status of |ZX_ERR_CANCELED|.\n\n If |FDF_CHANNEL_WAIT_OPTION_FORCE_ASYNC_CANCEL| is passed in |options|, a call\n to |fdf_channel_cancel_wait| will always call the callback rather than\n cancelling synchronously, even if the wait was started on a synchronized\n dispatcher.\n\n # Errors\n\n ZX_ERR_INVALID_ARGS: |dispatcher| or |channel_read| is an invalid pointer or NULL\n or |options| is an unknown option.\n\n ZX_ERR_PEER_CLOSED: There are no available messages and the other\n side of the channel is closed.\n\n ZX_ERR_BAD_STATE: There is already a dispatcher waiting on this channel.\n\n ZX_ERR_UNAVAILABLE: |dispatcher| is shutting down.\n\n This operation is thread-safe."]
    pub fn fdf_channel_wait_async(
        dispatcher: *mut fdf_dispatcher,
        channel_read: *mut fdf_channel_read,
        options: u32,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Cancels any pending callback registered via |fdf_channel_wait_async|.\n\n Whether the wait handler will run depends on whether the dispatcher it was registered with is\n synchronized or |FDF_CHANNEL_WAIT_OPTION_FORCE_ASYNC_CANCEL| was passed with in\n |fdf_channel_wait_async|.\n\n If the dispatcher is synchronized and |FDF_CHANNEL_WAIT_OPTION_FORCE_ASYNC_CANCEL| was not\n passed, this must only be called from a dispatcher thread, and any pending callback will be\n canceled synchronously.\n\n If the dispatcher is unsynchronized or |FDF_CHANNEL_WAIT_OPTION_FORCE_ASYNC_CANCEL| was passed,\n the callback will be scheduled to be called with status |ZX_ERR_CANCELED|.\n\n # Errors\n\n ZX_ERR_NOT_FOUND: There was no pending wait either because it is currently running (perhaps in a\n different thread), already scheduled to be run, already completed, or had not been started."]
    pub fn fdf_channel_cancel_wait(handle: fdf_handle_t) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " fdf_channel_call() is like a combined fdf_channel_write(), fdf_channel_wait_async(),\n and fdf_channel_read(), with the addition of a feature where a transaction id at\n the front of the message payload bytes is used to match reply messages with send messages,\n enabling multiple calling threads to share a channel without any additional client-side\n bookkeeping.\n\n The first four bytes of the written and read back messages are treated as a\n transaction ID of type fdf_txid_t. The runtime generates a txid for the\n written message, replacing that part of the message as read from the user.\n The runtime generated txid will be between 0x80000000 and 0xFFFFFFFF,\n and will not collide with any txid from any other fdf_channel_call()\n in progress against this channel endpoint. If the written message has a\n length of fewer than four bytes, an error is reported.\n\n While |deadline| has not passed, if an inbound message arrives with a matching txid,\n instead of being added to the tail of the general inbound message queue,\n it is delivered directly to the thread waiting in fdf_channel_call().\n\n If such a reply arrives after |deadline| has passed, it will arrive in the\n general inbound message queue.\n\n All written handles are consumed and are no longer available to the caller,\n on success or failure.\n\n # Errors\n\n ZX_ERR_INVALID_ARGS: |args| is NULL,\n or |wr_data| or |wr_handles| are non-NULL and not pointers managed by |wr_arena|,\n or any element in |handles| is not a valid handle,\n or |wr_num_bytes| is less than four,\n or at least one of |wr_handles| has a pending callback registered via |fdf_channel_wait_async|,\n or |rd_arena| is NULL when |rd_data| or |rd_handles| are non-NULL.\n\n ZX_ERR_PEER_CLOSED: The other side of the channel is closed.\n\n ZX_ERR_TIMED_OUT: |deadline| passed before a reply matching\n the correct txid was received.\n\n ZX_ERR_BAD_STATE: This is called from a driver runtime managed thread\n that does not allow sync calls.\n\n This operation is thread-safe."]
    pub fn fdf_channel_call(
        handle: fdf_handle_t,
        options: u32,
        deadline: zx_time_t,
        args: *const fdf_channel_call_args_t,
    ) -> zx_status_t;
}
#[doc = " A bi-directional in-process message transport capable of sending arena-managed raw data bytes\n as well as handles from one side to the other.\n\n # Thread safety\n\n Most operations on channel objects are thread-safe, except for |fdf_channel_cancel_wait|.\n\n # Example\n\n   // Read handler for asynchronous channel reads.\n   void read_handler(fdf_dispatcher_t* dispatcher, fdf_channel_read_t* read, zx_status_t status);\n\n   // Sends a request to the peer of |channel| and asynchronously waits for a response.\n   void send_request(fdf_handle_t channel, fdf_dispatcher_t* dispatcher dispatcher) {\n     fdf_arena_t* arena;\n     zx_status_t status = fdf_arena_create(0, 'exam', 0, &arena);\n\n     void* data = fdf_arena_allocate(arena, 0x1000);\n     // Set the data to transfer\n     ...\n\n     // Write the request to the channel.\n     status = fdf_channel_write(ch0, 0, arena, data, 0x1000, NULL, 0);\n\n     // Asynchronously wait for a response.\n     fdf_channel_read_t* channel_read = calloc(1, sizeof(fdf_channel_read_t));\n     channel_read->handler = read_handler;\n     channel_read->channel = ch0;\n     status = fdf_channel_wait_async(dispatcher, channel_read, 0);\n\n     // We are done with the arena.\n     fdf_arena_drop_ref(arena);\n   }\n\n   void read_handler(fdf_dispatcher_t* dispatcher, fdf_channel_read_t* read,\n                     zx_status_t status) {\n     fdf_arena_t* arena;\n     void* data data;\n     uint32_t data_size;\n     zx_handle_t* handles;\n     uint32_t num_handles;\n     zx_status_t status = fdf_channel_read(read->channel, 0, &arena, &data, &data_size,\n                                            &handles, &num_handles);\n     // Process the read data.\n     ...\n\n     // Read provides you with an arena which you may reuse for other requests.\n     // You are in charge of destroying the reference.\n     fdf_arena_drop_ref(arena);\n     free(read);\n   }\n"]
pub type fdf_channel_read_t = fdf_channel_read;
#[doc = " Handles execution of asynchronous read operations.\n\n The |status| is |ZX_OK| if the channel is ready to be read.\n The |status| is |ZX_ERR_CANCELED| if the dispatcher was shut down before\n the read handler ran."]
pub type fdf_channel_read_handler_t = ::core::option::Option<
    unsafe extern "C" fn(
        dispatcher: *mut fdf_dispatcher_t,
        read: *mut fdf_channel_read_t,
        status: zx_status_t,
    ),
>;
#[doc = " A bi-directional in-process message transport capable of sending arena-managed raw data bytes\n as well as handles from one side to the other.\n\n # Thread safety\n\n Most operations on channel objects are thread-safe, except for |fdf_channel_cancel_wait|.\n\n # Example\n\n   // Read handler for asynchronous channel reads.\n   void read_handler(fdf_dispatcher_t* dispatcher, fdf_channel_read_t* read, zx_status_t status);\n\n   // Sends a request to the peer of |channel| and asynchronously waits for a response.\n   void send_request(fdf_handle_t channel, fdf_dispatcher_t* dispatcher dispatcher) {\n     fdf_arena_t* arena;\n     zx_status_t status = fdf_arena_create(0, 'exam', 0, &arena);\n\n     void* data = fdf_arena_allocate(arena, 0x1000);\n     // Set the data to transfer\n     ...\n\n     // Write the request to the channel.\n     status = fdf_channel_write(ch0, 0, arena, data, 0x1000, NULL, 0);\n\n     // Asynchronously wait for a response.\n     fdf_channel_read_t* channel_read = calloc(1, sizeof(fdf_channel_read_t));\n     channel_read->handler = read_handler;\n     channel_read->channel = ch0;\n     status = fdf_channel_wait_async(dispatcher, channel_read, 0);\n\n     // We are done with the arena.\n     fdf_arena_drop_ref(arena);\n   }\n\n   void read_handler(fdf_dispatcher_t* dispatcher, fdf_channel_read_t* read,\n                     zx_status_t status) {\n     fdf_arena_t* arena;\n     void* data data;\n     uint32_t data_size;\n     zx_handle_t* handles;\n     uint32_t num_handles;\n     zx_status_t status = fdf_channel_read(read->channel, 0, &arena, &data, &data_size,\n                                            &handles, &num_handles);\n     // Process the read data.\n     ...\n\n     // Read provides you with an arena which you may reuse for other requests.\n     // You are in charge of destroying the reference.\n     fdf_arena_drop_ref(arena);\n     free(read);\n   }\n"]
#[repr(C)]
pub struct fdf_channel_read {
    pub state: async_state_t,
    pub handler: fdf_channel_read_handler_t,
    pub channel: fdf_handle_t,
    pub options: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fdf_channel_read"][::core::mem::size_of::<fdf_channel_read>() - 32usize];
    ["Alignment of fdf_channel_read"][::core::mem::align_of::<fdf_channel_read>() - 8usize];
    ["Offset of field: fdf_channel_read::state"]
        [::core::mem::offset_of!(fdf_channel_read, state) - 0usize];
    ["Offset of field: fdf_channel_read::handler"]
        [::core::mem::offset_of!(fdf_channel_read, handler) - 16usize];
    ["Offset of field: fdf_channel_read::channel"]
        [::core::mem::offset_of!(fdf_channel_read, channel) - 24usize];
    ["Offset of field: fdf_channel_read::options"]
        [::core::mem::offset_of!(fdf_channel_read, options) - 28usize];
};
impl Default for fdf_channel_read {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::core::fmt::Debug for fdf_channel_read {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "fdf_channel_read {{ handler: {:?} }}", self.handler)
    }
}
#[doc = " Holds context for the observer which will be called when the asynchronous shutdown\n for all dispatchers owned by a driver has completed.\n\n The client is responsible for retaining this structure in memory (and unmodified) until the\n handler runs."]
pub type fdf_env_driver_shutdown_observer_t = fdf_env_driver_shutdown_observer;
#[doc = " Called when the asynchronous shutdown for all dispatchers owned by |driver| has completed."]
pub type fdf_env_driver_shutdown_handler_t = ::core::option::Option<
    unsafe extern "C" fn(
        driver: *const ::core::ffi::c_void,
        observer: *mut fdf_env_driver_shutdown_observer_t,
    ),
>;
#[doc = " Holds context for the observer which will be called when the asynchronous shutdown\n for all dispatchers owned by a driver has completed.\n\n The client is responsible for retaining this structure in memory (and unmodified) until the\n handler runs."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fdf_env_driver_shutdown_observer {
    pub handler: fdf_env_driver_shutdown_handler_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fdf_env_driver_shutdown_observer"]
        [::core::mem::size_of::<fdf_env_driver_shutdown_observer>() - 8usize];
    ["Alignment of fdf_env_driver_shutdown_observer"]
        [::core::mem::align_of::<fdf_env_driver_shutdown_observer>() - 8usize];
    ["Offset of field: fdf_env_driver_shutdown_observer::handler"]
        [::core::mem::offset_of!(fdf_env_driver_shutdown_observer, handler) - 0usize];
};
#[doc = " Holds context for the stall scanner which will be called when stall scanning should occur.\n\n The client is responsible for retaining this structure in memory (and unmodified) until the\n handler runs."]
pub type fdf_env_stall_scanner_t = fdf_env_stall_scanner;
#[doc = " Called when stall scanning should begin."]
pub type fdf_env_stall_scan_begin = ::core::option::Option<
    unsafe extern "C" fn(scanner: *mut fdf_env_stall_scanner_t, duration: zx_duration_mono_t),
>;
#[doc = " Holds context for the stall scanner which will be called when stall scanning should occur.\n\n The client is responsible for retaining this structure in memory (and unmodified) until the\n handler runs."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fdf_env_stall_scanner {
    pub handler: fdf_env_stall_scan_begin,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fdf_env_stall_scanner"][::core::mem::size_of::<fdf_env_stall_scanner>() - 8usize];
    ["Alignment of fdf_env_stall_scanner"]
        [::core::mem::align_of::<fdf_env_stall_scanner>() - 8usize];
    ["Offset of field: fdf_env_stall_scanner::handler"]
        [::core::mem::offset_of!(fdf_env_stall_scanner, handler) - 0usize];
};
#[doc = " Holds context for the resume request which will be called when the runtime needs to be\n resumed.\n\n The client is responsible for retaining this structure in memory (and unmodified) until the\n handler runs."]
pub type fdf_env_resume_requester_t = fdf_env_resume_requester;
#[doc = " Called by the runtime to request to be resumed."]
pub type fdf_env_resume_request = ::core::option::Option<
    unsafe extern "C" fn(requester: *mut fdf_env_resume_requester_t) -> zx_status_t,
>;
#[doc = " Holds context for the resume request which will be called when the runtime needs to be\n resumed.\n\n The client is responsible for retaining this structure in memory (and unmodified) until the\n handler runs."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fdf_env_resume_requester {
    pub handler: fdf_env_resume_request,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fdf_env_resume_requester"]
        [::core::mem::size_of::<fdf_env_resume_requester>() - 8usize];
    ["Alignment of fdf_env_resume_requester"]
        [::core::mem::align_of::<fdf_env_resume_requester>() - 8usize];
    ["Offset of field: fdf_env_resume_requester::handler"]
        [::core::mem::offset_of!(fdf_env_resume_requester, handler) - 0usize];
};
#[doc = " Holds context for the suspend completion which will be called when the driver\n has completed suspending.\n\n The client is responsible for retaining this structure in memory (and unmodified) until the\n handler runs."]
pub type fdf_env_suspend_completer_t = fdf_env_suspend_completer;
#[doc = " Called by the runtime to signal completion of suspend."]
pub type fdf_env_suspend_complete =
    ::core::option::Option<unsafe extern "C" fn(completer: *mut fdf_env_suspend_completer_t)>;
#[doc = " Holds context for the suspend completion which will be called when the driver\n has completed suspending.\n\n The client is responsible for retaining this structure in memory (and unmodified) until the\n handler runs."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fdf_env_suspend_completer {
    pub handler: fdf_env_suspend_complete,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fdf_env_suspend_completer"]
        [::core::mem::size_of::<fdf_env_suspend_completer>() - 8usize];
    ["Alignment of fdf_env_suspend_completer"]
        [::core::mem::align_of::<fdf_env_suspend_completer>() - 8usize];
    ["Offset of field: fdf_env_suspend_completer::handler"]
        [::core::mem::offset_of!(fdf_env_suspend_completer, handler) - 0usize];
};
unsafe extern "C" {
    #[doc = " Start the driver runtime. This sets up the initial thread that the dispatchers run on."]
    pub fn fdf_env_start(options: u32) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Resets the driver runtime to zero threads. This may only be called when there are no\n existing dispatchers."]
    pub fn fdf_env_reset();
}
unsafe extern "C" {
    #[doc = " Same as |fdf_dispatcher_create| but allows setting the driver owner for the dispatcher.\n\n |driver| is an opaque pointer to the driver object. It will be used to uniquely identify\n the driver."]
    pub fn fdf_env_dispatcher_create_with_owner(
        driver: *const ::core::ffi::c_void,
        options: u32,
        name: *const ::core::ffi::c_char,
        name_len: usize,
        scheduler_role: *const ::core::ffi::c_char,
        scheduler_role_len: usize,
        observer: *mut fdf_dispatcher_shutdown_observer_t,
        out_dispatcher: *mut *mut fdf_dispatcher_t,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Dumps the state of the dispatcher to the INFO log."]
    pub fn fdf_env_dispatcher_dump(dispatcher: *mut fdf_dispatcher_t);
}
unsafe extern "C" {
    #[doc = " DO NOT USE THIS.\n This is a temporary function added to debug https://fxbug.dev/42069837.\n\n Dumps the state of the dispatcher into |out_dump|, as a NULL terminated string.\n The caller is responsible for freeing |out_dump|."]
    pub fn fdf_env_dispatcher_get_dump_deprecated(
        dispatcher: *mut fdf_dispatcher_t,
        out_dump: *mut *mut ::core::ffi::c_char,
    );
}
unsafe extern "C" {
    #[doc = " Asynchronously shuts down all dispatchers owned by |driver|.\n |observer| will be notified once shutdown completes. This is guaranteed to be\n after all the dispatcher's shutdown observers have been called, and will be running\n on the thread of the final dispatcher which has been shutdown.\n\n While a driver is shutting down, no new dispatchers can be created by the driver.\n\n If this succeeds, you must keep the |observer| object alive until the\n |observer| is notified.\n\n # Errors\n\n ZX_ERR_INVALID_ARGS: No driver matching |driver| was found.\n\n ZX_ERR_BAD_STATE: A driver shutdown observer was already registered."]
    pub fn fdf_env_shutdown_dispatchers_async(
        driver: *const ::core::ffi::c_void,
        observer: *mut fdf_env_driver_shutdown_observer_t,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Destroys all dispatchers in the process and blocks the current thread\n until each runtime dispatcher in the process is observed to have been destroyed.\n\n This should only be used called after all dispatchers have been shutdown.\n\n # Thread requirements\n\n This should not be called from a thread managed by the driver runtime,\n such as from tasks or ChannelRead callbacks."]
    pub fn fdf_env_destroy_all_dispatchers();
}
unsafe extern "C" {
    #[doc = " Notifies the runtime that we have entered a new driver context,\n such as via a Banjo call.\n\n |driver| is an opaque unique identifier for the driver."]
    pub fn fdf_env_register_driver_entry(driver: *const ::core::ffi::c_void);
}
unsafe extern "C" {
    #[doc = " Notifies the runtime that we have exited the current driver context."]
    pub fn fdf_env_register_driver_exit();
}
unsafe extern "C" {
    #[doc = " Returns the driver on top of the the thread's current call stack.\n Returns NULL if no drivers are on the stack."]
    pub fn fdf_env_get_current_driver() -> *const ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Returns whether the dispatcher has any queued tasks."]
    pub fn fdf_env_dispatcher_has_queued_tasks(dispatcher: *mut fdf_dispatcher_t) -> bool;
}
unsafe extern "C" {
    #[doc = " Returns the current maximum number of threads which will be spawned for thread pool associated\n with the given scheduler role.\n\n |scheduler_role| is the name of the role which is passed when creating dispatchers.\n |scheduler_role_len | is the length of the string, without including the terminating\n NULL character."]
    pub fn fdf_env_get_thread_limit(
        scheduler_role: *const ::core::ffi::c_char,
        scheduler_role_len: usize,
    ) -> u32;
}
unsafe extern "C" {
    #[doc = " Sets the number of threads which will be spawned for thread pool associated with the given\n scheduler role. It cannot shrink the limit less to a value lower than the current number of\n threads in the thread pool.\n\n |scheduler_role| is the name of the role which is passed when creating dispatchers.\n |scheduler_role_len | is the length of the string, without including the terminating\n NULL character.\n |max_threads| is the number of threads to use as new limit.\n\n # Errors\n\n ZX_ERR_OUT_OF_RANGE: |max_threads| is less that the current number of threads."]
    pub fn fdf_env_set_thread_limit(
        scheduler_role: *const ::core::ffi::c_char,
        scheduler_role_len: usize,
        max_threads: u32,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Returns the currently set options for the scheduler role as a uint32_t bitmask.\n\n |scheduler_role| is the name of the role which is passed when creating dispatchers.\n |scheduler_role_len| is the length of the string, without including the terminating\n NULL character."]
    pub fn fdf_env_get_scheduler_role_opts(
        scheduler_role: *const ::core::ffi::c_char,
        scheduler_role_len: usize,
    ) -> u32;
}
unsafe extern "C" {
    #[doc = " Sets the options for the given scheduler role. This can be used to enforce restrictions\n on the kinds of dispatchers that can be created on this scheduler role.\n\n Currently available options include:\n - `FDF_SCHEDULER_ROLE_OPTION_NO_SYNC_CALLS` will not allow any dispatchers on the\n scheduler role to be created with `FDF_DISPATCHER_OPTION_ALLOW_SYNC_CALLS`.\n\n |scheduler_role| is the name of the role which is passed when creating dispatchers.\n |scheduler_role_len| is the length of the string, without including the terminating\n NULL character.\n |options| is the new options for the scheduler role.\n\n # Errors\n\n ZX_ERR_INVALID_ARGS: |options| contains unknown or invalid options.\n ZX_ERR_NOT_SUPPORTED: |options| contains an option that wouldn't allow a dispatcher that\n already exists on this scheduler role."]
    pub fn fdf_env_set_scheduler_role_opts(
        scheduler_role: *const ::core::ffi::c_char,
        scheduler_role_len: usize,
        options: u32,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Adds an allowed scheduler role for the given driver."]
    pub fn fdf_env_add_allowed_scheduler_role_for_driver(
        driver: *const ::core::ffi::c_void,
        role: *const ::core::ffi::c_char,
        role_length: usize,
    );
}
unsafe extern "C" {
    #[doc = " Gets the opaque pointer uniquely associated with the driver currently running on the\n thread identified by |tid|.\n\n Returns the driver pointer through out parameter |out_driver|.\n\n # Errors\n\n ZX_ERR_NOT_FOUND: If the tid did not have a driver running on it, or the tid was not able\n to be identified.\n\n ZX_ERR_INVALID_ARGS: If the out_driver is not valid."]
    pub fn fdf_env_get_driver_on_tid(
        tid: zx_koid_t,
        out_driver: *mut *const ::core::ffi::c_void,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Scans active thread pools for threads that are stalled on long running tasks and potentially\n spawn new threads to compensate.\n\n # Thread requirements\n\n This should not be called from a thread managed by the driver runtime, such as from tasks or\n ChannelRead callbacks."]
    pub fn fdf_env_scan_threads_for_stalls();
}
unsafe extern "C" {
    #[doc = " Scans active thread pools for threads that are stalled on long running tasks and potentially\n spawn new threads to compensate.\n\n Returns the amount of time the caller should wait before calling this again as a\n `zx_duration_mono_t`. If 0 is returned, scanning should suspend until a start callback is made\n via the registered stall scanner.\n\n # Thread requirements\n\n This should not be called from a thread managed by the driver runtime, such as from tasks or\n ChannelRead callbacks."]
    pub fn fdf_env_scan_threads_for_stalls2() -> zx_duration_mono_t;
}
unsafe extern "C" {
    #[doc = " Registers a for callbacks for when stall scanning should occur."]
    pub fn fdf_env_register_stall_scanner(scanner: *mut fdf_env_stall_scanner_t);
}
unsafe extern "C" {
    #[doc = " Registers for callbacks for when the driver needs to be resumed.\n The callback being triggered should eventually result in |fdf_env_driver_resume| being called."]
    pub fn fdf_env_register_resume_requester(
        driver: *const ::core::ffi::c_void,
        requester: *mut fdf_env_resume_requester_t,
    );
}
unsafe extern "C" {
    #[doc = " Asynchronously suspends the dispatchers owned by the driver.\n The runtime will stop accepting new work and drain existing work before calling the completer."]
    pub fn fdf_env_driver_suspend(
        driver: *const ::core::ffi::c_void,
        completer: *mut fdf_env_suspend_completer_t,
    );
}
unsafe extern "C" {
    #[doc = " Resumes the dispatchers owned by the driver.\n The runtime will move pending callbacks back to the main queue and start accepting new work."]
    pub fn fdf_env_driver_resume(driver: *const ::core::ffi::c_void);
}
unsafe extern "C" {
    #[doc = " Creates a dispatcher on a unmanaged thread pool. This means that there are no background threads\n handling this dispatcher and so it has to be ran explicitly using the various run calls.\n See |fdf_env_dispatcher_create_with_owner| for more information about the parameters and return\n value."]
    pub fn fdf_testing_create_unmanaged_dispatcher(
        driver: *const ::core::ffi::c_void,
        options: u32,
        name: *const ::core::ffi::c_char,
        name_len: usize,
        observer: *mut fdf_dispatcher_shutdown_observer_t,
        out_dispatcher: *mut *mut fdf_dispatcher_t,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Sets the default driver dispatcher to be returned when the current thread does not have a driver\n associated with it. This is useful for tests that want to attach a dispatcher to their main\n test thread, so that they can use objects that contains a synchronization_checker.\n |dispatcher| should have been created using |fdf_testing_create_unmanaged_dispatcher|, or be a\n nullptr to remove an existing default.\n\n Returns |ZX_OK| if set successfully.\n Returns |ZX_ERR_BAD_STATE| if called from a thread managed by the driver runtime."]
    pub fn fdf_testing_set_default_dispatcher(dispatcher: *mut fdf_dispatcher_t) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Runs the unmanaged dispatcher pool on the current thread.\n\n Dispatches events until the |deadline| expires or it is quit.\n Use |ZX_TIME_INFINITE| to dispatch events indefinitely.\n\n If |once| is true, performs a single unit of work then returns.\n\n Returns |ZX_OK| if the dispatcher returns after one cycle.\n Returns |ZX_ERR_TIMED_OUT| if the deadline expired.\n Returns |ZX_ERR_CANCELED| if it quit.\n Returns |ZX_ERR_BAD_STATE| if the unmanaged dispatcher was shut down or if an unmanaged\n dispatcher has not been created."]
    pub fn fdf_testing_run(deadline: zx_time_t, once: bool) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Runs the unmanaged dispatcher pool on the current thread. Dispatches events until there are none\n remaining, and then returns without waiting. This is useful for unit testing, because the\n behavior doesn't depend on time.\n\n Returns |ZX_OK| if the dispatcher reaches an idle state.\n Returns |ZX_ERR_CANCELED| if it is quit.\n Returns |ZX_ERR_BAD_STATE| if the unmanaged dispatcher was shut down or if an unmanaged\n dispatcher has not been created."]
    pub fn fdf_testing_run_until_idle() -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Quits the unmanaged dispatcher pool if one has been created. Otherwise does nothing.\n Active invocations of |fdf_testing_run()| will eventually terminate upon completion of their\n current unit of work.\n\n Subsequent calls to |fdf_testing_run()|\n will return immediately until |fdf_testing_reset_quit()| is called."]
    pub fn fdf_testing_quit();
}
unsafe extern "C" {
    #[doc = " Resets the quit state of the unmanaged dispatcher pool so that it can be restarted\n using |fdf_testing_run()|.\n\n This function must only be called when the unmanaged dispatcher pool is not running.\n The caller must ensure all active invocations of |fdf_testing_run()| have terminated before\n resetting the quit state.\n\n Returns |ZX_OK| if the unmanaged dispatcher pool's quit state was correctly reset.\n Returns |ZX_ERR_BAD_STATE| if the unmanaged dispatcher pool was shutting down or if\n it was currently actively running, or if an unmanaged dispatcher has not been created."]
    pub fn fdf_testing_reset_quit() -> zx_status_t;
}
#[doc = " Tokens provide a mechanism for transferring FDF handles between drivers in the same process\n when a driver FIDL transport is not available. This is necessary as FDF handles cannot be\n transferred using the Zircon channel FIDL transport.\n\n A token is represented as a Zircon channel pair.\n\n # Example\n\n   // Child driver\n\n   void my_function() {\n     zx_channel_t token_local, token_remote;\n     zx_status_t status = zx_channel_create(0, &token_local, &token_remote);\n     ...\n     // Transfer |token_remote| to parent driver, perhaps over FIDL.\n     ...\n     fdf_handle_t channel_local, channel_remote;\n     status = fdf_channel_create(0, &channel_local, &channel_remote);\n     ...\n     zx_status_t status = fdf_token_transfer(token_local, channel_remote);\n     // The FDF handle |channel_remote| can be received by the parent\n     // driver who has the other side of the token.\n   }\n\n   // Parent driver\n\n   void my_function() {\n     zx_handle_t token;\n     // Token received from child driver.\n     ...\n     // Receive the driver handle for the token\n     fdf_handle_t channel;\n     zx_status_t status = fdf_token_receive(token, &channel);\n     ...\n   }"]
pub type fdf_token_t = fdf_token;
#[doc = " Handles the transfer of the fdf handle.\n\n If |status| is ZX_OK, transfers ownership of |handle|.\n\n The status is |ZX_OK| if the token was successfully transferred.\n The status is |ZX_ERR_CANCELED| if the dispatcher was shut down before the\n transfer was completed, or the peer token handle has been closed."]
pub type fdf_token_transfer_handler_t = ::core::option::Option<
    unsafe extern "C" fn(
        dispatcher: *mut fdf_dispatcher_t,
        token: *mut fdf_token_t,
        status: zx_status_t,
        handle: fdf_handle_t,
    ),
>;
#[doc = " Holds context for a registered token which is waiting for an fdf handle to be transferred.\n\n After successfully registering the protocol, the client is responsible for retaining\n the structure in memory (and unmodified) until the transfer handler runs.\n Thereafter, this structure may be registered again or destroyed."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fdf_token {
    pub handler: fdf_token_transfer_handler_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fdf_token"][::core::mem::size_of::<fdf_token>() - 8usize];
    ["Alignment of fdf_token"][::core::mem::align_of::<fdf_token>() - 8usize];
    ["Offset of field: fdf_token::handler"][::core::mem::offset_of!(fdf_token, handler) - 0usize];
};
unsafe extern "C" {
    #[doc = " Registers a token transfer handler for |token|.\n\n Note: This function is deprecated and will be removed at a later date. You should use\n |fdf_token_receive| instead.\n\n The transfer handler will be scheduled to be called on the dispatcher when a client calls\n |fdf_token_transfer| with the channel peer of |token|, If the connection has already been\n requested, the handler will be scheduled immediately.\n\n Transfers ownership of |token| to the runtime.\n\n All handles are consumed and are no longer available to the caller, on success or failure.\n\n # Errors\n\n ZX_ERR_BAD_HANDLE: |token| is not a valid channel handle.\n\n ZX_ERR_INVALID_ARGS: |handler| or |dispatcher| is NULL.\n\n ZX_ERR_BAD_STATE: The dispatcher is shutting down, or |handler|\n has already been registered."]
    pub fn fdf_token_register(
        token: zx_handle_t,
        dispatcher: *mut fdf_dispatcher_t,
        handler: *mut fdf_token_t,
    ) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Receives the corresponding driver handle for |token| if it has been transferred.\n\n If |fdf_token_transfer| has been called on |token|'s pair, this will receive the\n driver handle that was passed to it and store it in the address pointed to by\n |handle|.\n\n Transfers ownership of |token| to the runtime.\n\n The |token| handle is consumed and is no longer available to the caller, on success or failure.\n\n # Errors\n\n ZX_ERR_BAD_HANDLE: |token| is not a valid channel handle.\n\n ZX_ERR_INVALID_ARGS: |handle| is NULL.\n\n ZX_ERR_NOT_FOUND: The |token|'s pair has not been transferred before this\n call."]
    pub fn fdf_token_receive(token: zx_handle_t, handle: *mut fdf_handle_t) -> zx_status_t;
}
unsafe extern "C" {
    #[doc = " Transfers the fdf handle to the owner of the channel peer of |token|.\n\n The token transfer handler which was, or will be registered with the\n channel peer of |token| will receive |handle|.\n\n Transfers ownership of |token| to the runtime, and ownership of |handle| to\n the driver who registered the token.\n\n All handles are consumed and are no longer available to the caller, on success or failure.\n\n # Errors\n\n ZX_ERR_BAD_HANDLE: |token| is not a valid channel handle,\n or |handle| is not a valid FDF handle.\n\n ZX_ERR_BAD_STATE: The dispatcher is shutting down."]
    pub fn fdf_token_transfer(token: zx_handle_t, handle: fdf_handle_t) -> zx_status_t;
}
#[doc = " The |DriverRegistration| is the ABI for drivers to expose themselves to the Driver Framework.\n The driver is loaded in as a shared library (also referred to as a DSO), and the global symbol\n `__fuchsia_driver_registration__` is used by the Driver Framework to locate this\n DriverRegistration in the driver library. The framework will use this to initiate a FIDL based\n connection over the driver transport into the driver."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DriverRegistration {
    #[doc = " The version is not expected to change since the evolution of the driver APIs will happen\n on the FIDL side. This simply exists in case we need to evolve the initialization signature\n for any reason."]
    pub version: u64,
    pub v1: DriverRegistration_driver_registration_v1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct DriverRegistration_driver_registration_v1 {
    #[doc = " Pointer to a function that can initialize the driver server on the |server_handle|.\n\n Errors to initialize the driver server can be propagated by closing the |server_handle| with\n an epitaph, but driver start failures should use the corresponding FIDL protocol.\n\n This function is executed on the default driver dispatcher. This dispatcher is synchronized\n and runs on a shared driver thread within a `driver_host`. The driver can access this\n dispatcher using |fdf_dispatcher_get_current_dispatcher()| or in C++ with\n |fdf::Dispatcher::GetCurrent()|. This can be stored in an\n |fdf::UnownedSynchronizedDispatcher| as the driver host is the owner of the dispatcher.\n\n |server_handle| is the server end for the |fuchsia.driver.framework/Driver| protocol that\n the driver should begin serving on. This should be served on the driver dispatcher\n that this function is executed on.\n\n The return result is a `void*` token that the driver framework will pass into |destroy|."]
    pub initialize: ::core::option::Option<
        unsafe extern "C" fn(server_handle: fdf_handle_t) -> *mut ::core::ffi::c_void,
    >,
    #[doc = " Pointer to a function that can free the resources that were allocated as part of\n |initialize|. Generally this will just be the object allocated to serve the\n |fuchsia.driver.framework/Driver| protocol.\n\n This function is executed after all of the dispatchers belonging to the driver have fully\n been shutdown, including the default dispatcher that |initialize| was executed on.\n\n |token| is the return result of the |initialize| function."]
    pub destroy: ::core::option::Option<unsafe extern "C" fn(token: *mut ::core::ffi::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DriverRegistration_driver_registration_v1"]
        [::core::mem::size_of::<DriverRegistration_driver_registration_v1>() - 16usize];
    ["Alignment of DriverRegistration_driver_registration_v1"]
        [::core::mem::align_of::<DriverRegistration_driver_registration_v1>() - 8usize];
    ["Offset of field: DriverRegistration_driver_registration_v1::initialize"]
        [::core::mem::offset_of!(DriverRegistration_driver_registration_v1, initialize) - 0usize];
    ["Offset of field: DriverRegistration_driver_registration_v1::destroy"]
        [::core::mem::offset_of!(DriverRegistration_driver_registration_v1, destroy) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DriverRegistration"][::core::mem::size_of::<DriverRegistration>() - 24usize];
    ["Alignment of DriverRegistration"][::core::mem::align_of::<DriverRegistration>() - 8usize];
    ["Offset of field: DriverRegistration::version"]
        [::core::mem::offset_of!(DriverRegistration, version) - 0usize];
    ["Offset of field: DriverRegistration::v1"]
        [::core::mem::offset_of!(DriverRegistration, v1) - 8usize];
};
pub const DRIVER_REGISTRATION_VERSION_1: u64 = 1;
pub const DRIVER_REGISTRATION_VERSION_MAX: u64 = 1;
